---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateIntegerOfType(System.Int32,System.String)
source: html/f9f8f35e-a8d7-4d3e-1e73-b0d6e85da104.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateIntegerOfType Method

Creates an integer data object of the specified type.

## Syntax (C#)
```csharp
public static IFCData CreateIntegerOfType(
	int value,
	string typeName
)
```

## Parameters
- **value** (`System.Int32`) - The integer value.
- **typeName** (`System.String`) - The type name.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null